src/DataProcessors/ПоискНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПоискНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ПоискНоменклатуры/Ext/ManagerModule.bsl
Процедура ВыполнитьПоискНоменклатуры(Параметры,АдресХранилища) Экспорт
	СписокВидовДокументов = параметры.МассивВидов; 
	
	ДокМетаданные  =  Метаданные.Документы;
	ТекстЗапросаОбщий = "";
		
	Для Каждого ВидДокумента из СписокВидовДокументов цикл
		мДок = ДокМетаданные.Найти(ВидДокумента);
		
		ТекстЗапроса = 	 "
						 |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		               	 |	ТЧДокумента.Ссылка как Документ,						 
						 |	ТЧДокумента.Ссылка.Номер КАК Номер,
	          			 |	ТЧДокумента.Ссылка.Дата КАК Дата,
						 |	ТЧДокумента.Ссылка.Проведен КАК Проведен, 
						 |  %2 КАК Контрагент,
						 |  %3 КАК Организация,
						 |  %4 КАК СуммаДокумента,
						 |  %5 КАК СтатусДокумента
						 |ИЗ
		               	 |	Документ.%1.Товары КАК ТЧДокумента
		               	 |ГДЕ
						 |	ТЧДокумента.Номенклатура = &Номенклатура И
						 |	ТЧДокумента.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода"  ;
						 
			ТекстЗапроса = 	 СтрШаблон(ТекстЗапроса,ВидДокумента,
						 ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", мДок),"ТЧДокумента.Ссылка.Контрагент","Значение(Справочник.Контрагенты.ПустаяСсылка)"),
						 ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", мДок),"ТЧДокумента.Ссылка.Организация","Значение(Справочник.Организации.ПустаяСсылка)"),
						 ?(ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаДокумента", мДок),"ТЧДокумента.Ссылка.СуммаДокумента","0"),
						 ?(ОбщегоНазначения.ЕстьРеквизитДокумента("СтатусДокумента", мДок),"ТЧДокумента.Ссылка.СтатусДокумента","Значение(Справочник.СтатусыДокументов.ПустаяСсылка)")) ;
						 
						 Если ТекстЗапросаОбщий ="" тогда 
							 ТекстЗапросаОбщий  = ТекстЗапроса;
						 иначе 
						ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
						|
						|ОБЪЕДИНИТЬ ВСЕ
						| "+
						ТекстЗапроса;
						
						КонецЕсли; 
						
							 
										 
	КонецЦикла;	
	
	Если ТекстЗапросаОбщий = "" тогда 
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано ниодного типа документа");
		 Возврат;
	 КонецЕсли;
	 
	 	
	Запрос = Новый Запрос;
	запрос.Текст = ТекстЗапросаОбщий;
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.ДатаОкончания);
	
	ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить(), АдресХранилища);
	
	
	
КонецПроцедуры
